INSERT INTO transactions (date, time, card, merchant, amount_krw, amount_usd, payment_method, merchant_info, discount, points, status, due_date, approval_no) VALUES
('2026-02-26', '11:11', 'KB국민 다담카드(비OTP)', 'KFC계산동', 10300.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-04-05', '30055996'),
('2026-02-25', '12:38', 'KB국민 다담카드(비OTP)', '현장발권-S', 9100.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-04-05', '30055989'),
('2026-02-25', '11:24', 'KB국민 다담카드(비OTP)', '한별약국', 184000.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-04-05', '30055974'),
('2026-02-25', '11:15', 'KB국민 다담카드(비OTP)', '제일의원', 60000.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-04-05', '30055963'),
('2026-02-25', '07:05', 'KB국민 다담카드(비OTP)', '시외버스 모바일(티머니)', 9100.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-04-05', '30055955'),
('2026-02-21', '20:25', 'KB국민 다담카드(비OTP)', '에스더몰', 26700.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-03-05', '30055943'),
('2026-02-21', '19:00', 'KB국민 다담카드(비OTP)', '쿠팡(쿠페이)', 25900.00, 0.00, '일시불', '', 0.00, 1295.00, '전표매입', '2026-03-05', '30055932'),
('2026-02-19', '17:40', 'KB국민 다담카드(비OTP)', '아성다이소', 6000.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-03-05', '30055921'),
('2026-02-18', '21:09', 'KB국민 다담카드(비OTP)', '쿠팡(쿠페이)', 106690.00, 0.00, '일시불', '', 0.00, 5334.00, '전표매입', '2026-03-05', '30055913'),
('2026-02-17', '10:48', 'KB국민 다담카드(비OTP)', '(주) 다각도', 35400.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-03-05', '30055908');

INSERT INTO transactions (date, time, card, merchant, amount_krw, amount_usd, payment_method, merchant_info, discount, points, status, due_date, approval_no) VALUES
('2026-01-21', '05:39', 'KB국민 다담카드(비OTP)', '터널/도로 6 건', 4800.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-02-05', '42811641'),
('2026-01-20', '11:07', 'KB국민 다담카드(비OTP)', '이음카드_공공기관_KPN(비)', 1000.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-02-05', '30055717'),
('2026-01-17', '10:08', 'KB국민 다담카드(비OTP)', '현대홈쇼핑', 145350.00, 0.00, '일시불', '스타샵(적립)', 0.00, 10290.00, '전표매입', '2026-02-05', '30055707'),
('2026-01-16', '17:06', 'KB국민 다담카드(비OTP)', '인천세종병원', 8700.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-02-05', '30055696'),
('2026-01-12', '08:57', 'KB국민 다담카드(비OTP)', 'KT통신요금자동납부', 25300.00, 0.00, '일시불', '', 2530.00, 0.00, '전표매입', '2026-02-05', '30055687'),
('2025-09-30', '13:20', 'KB국민 다담카드(비OTP)', '인천세종병원', 2150000.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2025-11-05', '30054594'),
('2025-12-30', '06:19', 'KB국민 다담카드(비OTP)', '네이버페이', 277444.00, 0.00, '일시불', '', 0.00, 0.00, '전표매입', '2026-02-05', '30055549');

DELETE FROM member;
INSERT INTO member (id, name, email, username, password, role) VALUES
('admin', '슈퍼관리자', 'admin@example.com', 'admin', '$2a$10$GRLdNijSQMUvl/au9ShLOmqnWQmL4.ybBE672FeTrAnQun9S/K9H6', 'SUPER_ADMIN'),
('middle', '중간관리자', 'middle@example.com', 'middle', '$2a$10$GRLdNijSQMUvl/au9ShLOmqnWQmL4.ybBE672FeTrAnQun9S/K9H6', 'MIDDLE_ADMIN'),
('user', '일반관리자', 'user@example.com', 'user', '$2a$10$GRLdNijSQMUvl/au9ShLOmqnWQmL4.ybBE672FeTrAnQun9S/K9H6', 'GENERAL_ADMIN');
-- Note: password hash is for '1234'
